SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/ZGM23/Include/zgm23_synth.h
/* Bit fields for SYNTH SEQIF */
#define _SYNTH_SEQIF_RESETVALUE                       0x00000000UL                          /**< Default value for SYNTH_SEQIF               */
#define _SYNTH_SEQIF_MASK                             0x00000237UL                          /**< Mask for SYNTH_SEQIF                        */
#define SYNTH_SEQIF_LOCKED                            (0x1UL << 0)                          /**< Synthesizer locked Interrupt Flag           */
#define _SYNTH_SEQIF_LOCKED_SHIFT                     0                                     /**< Shift value for SYNTH_LOCKED                */
#define _SYNTH_SEQIF_LOCKED_MASK                      0x1UL                                 /**< Bit mask for SYNTH_LOCKED                   */
#define _SYNTH_SEQIF_LOCKED_DEFAULT                   0x00000000UL                          /**< Mode DEFAULT for SYNTH_SEQIF                */
#define SYNTH_SEQIF_LOCKED_DEFAULT                    (_SYNTH_SEQIF_LOCKED_DEFAULT << 0)    /**< Shifted mode DEFAULT for SYNTH_SEQIF        */
#define SYNTH_SEQIF_UNLOCKED                          (0x1UL << 1)                          /**< Synthesizer unlocked Interrupt Flag         */
#define _SYNTH_SEQIF_UNLOCKED_SHIFT                   1                                     /**< Shift value for SYNTH_UNLOCKED              */
#define _SYNTH_SEQIF_UNLOCKED_MASK                    0x2UL                                 /**< Bit mask for SYNTH_UNLOCKED                 */
#define _SYNTH_SEQIF_UNLOCKED_DEFAULT                 0x00000000UL                          /**< Mode DEFAULT for SYNTH_SEQIF                */
#define SYNTH_SEQIF_UNLOCKED_DEFAULT                  (_SYNTH_SEQIF_UNLOCKED_DEFAULT << 1)  /**< Shifted mode DEFAULT for SYNTH_SEQIF        */
#define SYNTH_SEQIF_SYRDY                             (0x1UL << 2)                          /**< Synthesizer ready Interrupt Flag            */
#define _SYNTH_SEQIF_SYRDY_SHIFT                      2                                     /**< Shift value for SYNTH_SYRDY                 */
#define _SYNTH_SEQIF_SYRDY_MASK                       0x4UL                                 /**< Bit mask for SYNTH_SYRDY                    */
#define _SYNTH_SEQIF_SYRDY_DEFAULT                    0x00000000UL                          /**< Mode DEFAULT for SYNTH_SEQIF                */
#define SYNTH_SEQIF_SYRDY_DEFAULT                     (_SYNTH_SEQIF_SYRDY_DEFAULT << 2)     /**< Shifted mode DEFAULT for SYNTH_SEQIF        */
#define SYNTH_SEQIF_VCOHIGH                           (0x1UL << 4)                          /**< VCO high voltage Interrupt Flag             */
#define _SYNTH_SEQIF_VCOHIGH_SHIFT                    4                                     /**< Shift value for SYNTH_VCOHIGH               */
#define _SYNTH_SEQIF_VCOHIGH_MASK                     0x10UL                                /**< Bit mask for SYNTH_VCOHIGH                  */
#define _SYNTH_SEQIF_VCOHIGH_DEFAULT                  0x00000000UL                          /**< Mode DEFAULT for SYNTH_SEQIF                */
#define SYNTH_SEQIF_VCOHIGH_DEFAULT                   (_SYNTH_SEQIF_VCOHIGH_DEFAULT << 4)   /**< Shifted mode DEFAULT for SYNTH_SEQIF        */
#define SYNTH_SEQIF_VCOLOW                            (0x1UL << 5)                          /**< VCO low voltage Interrupt Flag              */
#define _SYNTH_SEQIF_VCOLOW_SHIFT                     5                                     /**< Shift value for SYNTH_VCOLOW                */
#define _SYNTH_SEQIF_VCOLOW_MASK                      0x20UL                                /**< Bit mask for SYNTH_VCOLOW                   */
#define _SYNTH_SEQIF_VCOLOW_DEFAULT                   0x00000000UL                          /**< Mode DEFAULT for SYNTH_SEQIF                */
#define SYNTH_SEQIF_VCOLOW_DEFAULT                    (_SYNTH_SEQIF_VCOLOW_DEFAULT << 5)    /**< Shifted mode DEFAULT for SYNTH_SEQIF        */
#define SYNTH_SEQIF_LOCNTDONE                         (0x1UL << 9)                          /**< LOCNT measurement done Interrupt Flag       */
#define _SYNTH_SEQIF_LOCNTDONE_SHIFT                  9                                     /**< Shift value for SYNTH_LOCNTDONE             */
#define _SYNTH_SEQIF_LOCNTDONE_MASK                   0x200UL                               /**< Bit mask for SYNTH_LOCNTDONE                */
#define _SYNTH_SEQIF_LOCNTDONE_DEFAULT                0x00000000UL                          /**< Mode DEFAULT for SYNTH_SEQIF                */
#define SYNTH_SEQIF_LOCNTDONE_DEFAULT                 (_SYNTH_SEQIF_LOCNTDONE_DEFAULT << 9) /**< Shifted mode DEFAULT for SYNTH_SEQIF        */

/* Bit fields for SYNTH SEQIEN */
#define _SYNTH_SEQIEN_RESETVALUE                      0x00000000UL                           /**< Default value for SYNTH_SEQIEN              */
#define _SYNTH_SEQIEN_MASK                            0x00000237UL                           /**< Mask for SYNTH_SEQIEN                       */
#define SYNTH_SEQIEN_LOCKED                           (0x1UL << 0)                           /**< LOCKED Interrupt Enable                     */
#define _SYNTH_SEQIEN_LOCKED_SHIFT                    0                                      /**< Shift value for SYNTH_LOCKED                */
#define _SYNTH_SEQIEN_LOCKED_MASK                     0x1UL                                  /**< Bit mask for SYNTH_LOCKED                   */
#define _SYNTH_SEQIEN_LOCKED_DEFAULT                  0x00000000UL                           /**< Mode DEFAULT for SYNTH_SEQIEN               */
#define SYNTH_SEQIEN_LOCKED_DEFAULT                   (_SYNTH_SEQIEN_LOCKED_DEFAULT << 0)    /**< Shifted mode DEFAULT for SYNTH_SEQIEN       */
#define SYNTH_SEQIEN_UNLOCKED                         (0x1UL << 1)                           /**< UNLOCKED Interrupt Enable                   */
#define _SYNTH_SEQIEN_UNLOCKED_SHIFT                  1                                      /**< Shift value for SYNTH_UNLOCKED              */
#define _SYNTH_SEQIEN_UNLOCKED_MASK                   0x2UL                                  /**< Bit mask for SYNTH_UNLOCKED                 */
#define _SYNTH_SEQIEN_UNLOCKED_DEFAULT                0x00000000UL                           /**< Mode DEFAULT for SYNTH_SEQIEN               */
#define SYNTH_SEQIEN_UNLOCKED_DEFAULT                 (_SYNTH_SEQIEN_UNLOCKED_DEFAULT << 1)  /**< Shifted mode DEFAULT for SYNTH_SEQIEN       */
#define SYNTH_SEQIEN_SYRDY                            (0x1UL << 2)                           /**< CAPCALDONE Interrupt Enable                 */
#define _SYNTH_SEQIEN_SYRDY_SHIFT                     2                                      /**< Shift value for SYNTH_SYRDY                 */
#define _SYNTH_SEQIEN_SYRDY_MASK                      0x4UL                                  /**< Bit mask for SYNTH_SYRDY                    */
#define _SYNTH_SEQIEN_SYRDY_DEFAULT                   0x00000000UL                           /**< Mode DEFAULT for SYNTH_SEQIEN               */
#define SYNTH_SEQIEN_SYRDY_DEFAULT                    (_SYNTH_SEQIEN_SYRDY_DEFAULT << 2)     /**< Shifted mode DEFAULT for SYNTH_SEQIEN       */
#define SYNTH_SEQIEN_VCOHIGH                          (0x1UL << 4)                           /**< VCOHIGH Interrupt Enable                    */
#define _SYNTH_SEQIEN_VCOHIGH_SHIFT                   4                                      /**< Shift value for SYNTH_VCOHIGH               */
#define _SYNTH_SEQIEN_VCOHIGH_MASK                    0x10UL                                 /**< Bit mask for SYNTH_VCOHIGH                  */
#define _SYNTH_SEQIEN_VCOHIGH_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for SYNTH_SEQIEN               */
#define SYNTH_SEQIEN_VCOHIGH_DEFAULT                  (_SYNTH_SEQIEN_VCOHIGH_DEFAULT << 4)   /**< Shifted mode DEFAULT for SYNTH_SEQIEN       */
#define SYNTH_SEQIEN_VCOLOW                           (0x1UL << 5)                           /**< VCOLOW Interrupt Enable                     */
#define _SYNTH_SEQIEN_VCOLOW_SHIFT                    5                                      /**< Shift value for SYNTH_VCOLOW                */
#define _SYNTH_SEQIEN_VCOLOW_MASK                     0x20UL                                 /**< Bit mask for SYNTH_VCOLOW                   */
#define _SYNTH_SEQIEN_VCOLOW_DEFAULT                  0x00000000UL                           /**< Mode DEFAULT for SYNTH_SEQIEN               */
#define SYNTH_SEQIEN_VCOLOW_DEFAULT                   (_SYNTH_SEQIEN_VCOLOW_DEFAULT << 5)    /**< Shifted mode DEFAULT for SYNTH_SEQIEN       */
#define SYNTH_SEQIEN_LOCNTDONE                        (0x1UL << 9)                           /**< LOCNTDONE Interrupt Enable                  */
#define _SYNTH_SEQIEN_LOCNTDONE_SHIFT                 9                                      /**< Shift value for SYNTH_LOCNTDONE             */
#define _SYNTH_SEQIEN_LOCNTDONE_MASK                  0x200UL                                /**< Bit mask for SYNTH_LOCNTDONE                */
#define _SYNTH_SEQIEN_LOCNTDONE_DEFAULT               0x00000000UL                           /**< Mode DEFAULT for SYNTH_SEQIEN               */
#define SYNTH_SEQIEN_LOCNTDONE_DEFAULT                (_SYNTH_SEQIEN_LOCNTDONE_DEFAULT << 9) /**< Shifted mode DEFAULT for SYNTH_SEQIEN       */

/** @} End of group ZGM23_SYNTH_BitFields */
/** @} End of group ZGM23_SYNTH */
/** @} End of group Parts */

#endif /* ZGM23_SYNTH_H */
